schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
/*
 * Solectrac CAN monitor for ESP32
 *
 * Reads J1939 CAN frames from the Solectrac 25G tractor (250 kbit/s) via the
 * ESP32's built-in TWAI peripheral, decodes all known signals, and serves
 * them as JSON over a simple HTTP endpoint.
 *
 * Hardware:
 *   Connect a CAN transceiver (SN65HVD230, TJA1050, MCP2551) between the
 *   ESP32 and the CAN bus. Adjust CAN_TX_PIN and CAN_RX_PIN below to match
 *   your wiring.
 *
 * Endpoints:
 *   GET /       — mobile-friendly dashboard (auto-refreshing)
 *   GET /json   — raw JSON
 */

#include <Arduino.h>
#include <WiFi.h>
#include <ESPmDNS.h>
#include <DNSServer.h>
#include <WebServer.h>
#include <ArduinoJson.h>
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include "driver/twai.h"
#if defined(BOARD_LILYGO_T2CAN)
  #include <SPI.h>
  #include <ACAN2517FD.h>
#endif

// ── Configuration ─────────────────────────────────────────────────────────────

#ifndef WIFI_SSID
#error "Set WIFI_SSID env var before building"
#endif
#ifndef WIFI_PASS
#error "Set WIFI_PASS env var before building"
#endif

// Per-board pin map. Selected via -DBOARD_* in platformio.ini.
#if defined(BOARD_ADAFRUIT_FEATHER_S3)
  #define CAN_TX_PIN       GPIO_NUM_8
  #define CAN_RX_PIN       GPIO_NUM_14
  #define LED_PIN          GPIO_NUM_33
  #define LED_POWER_PIN    GPIO_NUM_21
  #define LED_IS_NEOPIXEL  1
#elif defined(BOARD_LILYGO_T2CAN)
  // LilyGo T-2CAN exposes both CAN ports: CAN B is the ESP32-S3's native TWAI
  // on GPIO 6/7; CAN A is an MCP2518FD on SPI. We stream both buses out
  // over socketcand as channels can0 (TWAI) and can1 (MCP2518FD).
  // pin_config.h documents no user-controllable LED.
  #define CAN_TX_PIN       GPIO_NUM_7
  #define CAN_RX_PIN       GPIO_NUM_6
  #define MCP2518_CS_PIN   GPIO_NUM_10
  #define MCP2518_SCK_PIN  GPIO_NUM_12
  #define MCP2518_MOSI_PIN GPIO_NUM_11
  #define MCP2518_MISO_PIN GPIO_NUM_13
  #define MCP2518_INT_PIN  GPIO_NUM_8
  #define HAS_MCP2518FD    1
  #define LED_IS_NEOPIXEL  0
#else
  #error "Define a board: BOARD_ADAFRUIT_FEATHER_S3 or BOARD_LILYGO_T2CAN"
#endif

// WiFi runs in dual AP+STA mode: the board always broadcasts its own hotspot
// (so it's reachable in the field), and concurrently tries to join the
// configured home network for bench use. AP IP is 192.168.4.1.
#define AP_SSID "tractor"
#define AP_PASS "electricity"

// ── J1939 source addresses ────────────────────────────────────────────────────

#define SRC_BMS         0xF3   // BMS broadcast
#define SRC_BMS_CHGR_IF 0xF4   // BMS charger-interface role (sends 0x000600)
#define SRC_CHARGER     0xE5   // External charger
#define SRC_VEHICLE     0xD0   // Vehicle controller
#define SRC_MOTOR       0xCA   // Motor / drive ECU
#define SRC_DASH        0x12   // Dashboard heartbeat

// ── PGN constants ─────────────────────────────────────────────────────────────

#define PGN_CELL_FIRST  0xF113   // BMS cell voltage frames (4 cells each)
#define PGN_CELL_LAST   0xF13C
#define PGN_TEMP_FIRST  0xF155   // BMS module temp frames (8 temps each)
#define PGN_TEMP_LAST   0xF15E
#define PGN_F100        0xF100   // Pack status: V, I, SoC
#define PGN_F102        0xF102   // Cell min/max summary
#define PGN_F104        0xF104   // Temp min/max summary
#define PGN_F106        0xF106   // BMS state flags
#define PGN_F107        0xF107   // BMS current limits
#define PGN_F108        0xF108   // BMS active fault bitmap
#define PGN_FF50        0xFF50   // Charger telemetry
#define PGN_FF21        0xFF21   // Motor telemetry / dash heartbeat
#define PGN_FECA        0xFECA   // DM1 (Active Diagnostic Trouble Codes)
#define PGN_PROP_0600   0x0600   // BMS→charger command (PDU1, dest 0xE5)

// ── Decode constants ──────────────────────────────────────────────────────────

#define NUM_CELLS               20
#define NUM_TEMPS               7
#define TEMP_OFFSET_C           40
#define PACK_CURRENT_BIAS_RAW   0x7D00   // raw u16 value at 0 A
#define PACK_CURRENT_LSB_A      0.1f     // A per bit
#define PACK_VOLTAGE_LSB_V      0.1f     // V per bit (F100F3 / FF50E5 bytes 0-1 BE)
#define RPM_BIAS                0x0C80   // raw u16 value at 0 RPM
#define LIMIT_CURRENT_LSB_A     0.01f    // A per bit for F107 limits
#define LIMIT_POWER_EXTRA_LSB_W 10.0f    // W per bit for F107 charge allowance above 100 A baseline
#define CHARGER_I_LSB_A         0.1f     // A per bit for charger current

// FF50E5 byte 4: Elcon/TC charger fault flags. 0x00 = actively delivering.
#define CHGR_FLAG_HW_FAIL       0x01     // hardware failure
#define CHGR_FLAG_OVER_TEMP     0x02     // charger over-temperature
#define CHGR_FLAG_NO_AC         0x04     // input (AC) voltage abnormal / absent
#define CHGR_FLAG_NO_BATTERY    0x08     // battery voltage not detected at output
#define CHGR_FLAG_COMM_TIMEOUT  0x10     // no 1806E5F4 command received
#define PACK_CAPACITY_WH        25000.0f // nominal usable pack energy (Solectrac e25 spec)

// ── BMS fault code tables ─────────────────────────────────────────────────────
// Bytes 0–6: each element maps one bit (LSB first) to a vendor fault code.
// 0 = silent (no code on dashboard for this bit).
// Based on injection sweep 2026-05-10.

static const uint8_t FAULT_BYTES_0_TO_6[7][8] = {
    {100, 100, 101, 101, 102, 102, 103, 103},   // byte 0
    {104, 104, 105, 105, 106, 106, 107, 107},   // byte 1
    {108, 108, 109, 109, 110, 110, 111, 111},   // byte 2
    {112, 112, 113, 113,   0,   0,   0,   0},   // byte 3 (114/115 reserved)
    {116, 117, 118, 119, 120, 121, 122, 123},   // byte 4
    {124, 125, 126, 127,   0,   0,   0,   0},   // byte 5
    {  0,   0,   0,   0,   0,   0,   0,   0},   // byte 6 (all silent)
};

// Byte 7: bit → code. 0 = silent. Bit 5 and bit 6 both map to 144 (confirmed
// duplicate). Code 146 does NOT appear in F108.
static const uint8_t FAULT_BYTE7[8] = {140, 0, 0, 142, 143, 144, 144, 145};

// ── State structs ─────────────────────────────────────────────────────────────

struct PackState {
    float   voltage_v  = NAN;
    float   current_a  = NAN;
    int32_t current_raw = -1;
    float   power_w    = NAN;
    uint8_t soc_raw    = 0;
    float   soc_pct    = NAN;
    // F102
    int16_t cell_max_mv   = -1;
    int16_t cell_min_mv   = -1;
    int16_t cell_spread_mv = -1;
    uint8_t cell_max_n    = 0;
    uint8_t cell_min_n    = 0;
    int16_t cell_spread_mv_reported = -1;
    float   v_estimate    = NAN;
    // F104
    int8_t  temp_max_c   = INT8_MIN;
    int8_t  temp_min_c   = INT8_MIN;
    uint8_t temp_max_n   = 0;
    uint8_t temp_min_n   = 0;
    int8_t  temp_spread_c = -1;
};

struct BmsStateFlags {
    uint8_t byte0 = 0, byte1 = 0;
    bool output_enable   : 1;
    bool main_contactor  : 1;
    bool operating       : 1;
    bool standby         : 1;
    bool charging        : 1;
    bool no_drive        : 1;
    bool drive_mode      : 1;
    bool awake           : 1;
    bool valid           : 1;
    BmsStateFlags() : output_enable(false), main_contactor(false),
        operating(false), standby(false), charging(false),
        no_drive(false), drive_mode(false), awake(false),
        valid(false) {}
};

