schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
void slcanHandleCommand(const char* cmd) {
    switch (cmd[0]) {
        case 'O': slcan_open = true;  Serial.write('\r'); break;
        case 'C': slcan_open = false; Serial.write('\r'); break;
        case 'S': Serial.write('\r'); break;   // speed — fixed at 250k
        case 'V': Serial.print("V1013\r"); break;
        case 'N': Serial.print("NA000\r"); break;
        case 'F': Serial.print("F00\r");   break;
        default:  Serial.write('\r'); break;
    }
}

void slcanPoll() {
    while (Serial.available()) {
        char c = Serial.read();
        if (c == '\r' || c == '\n') {
            if (slcan_len > 0) {
                slcan_buf[slcan_len] = '\0';
                slcanHandleCommand(slcan_buf);
                slcan_len = 0;
            }
        } else if (slcan_len < sizeof(slcan_buf) - 1) {
            slcan_buf[slcan_len++] = c;
        }
    }
}

// ── socketcand ────────────────────────────────────────────────────────────────
// Streams raw CAN frames over WiFi using the socketcand ASCII protocol.
// python-can: interface='socketcand', host='tractor.local', port=28600,
//             channel='can0'
//
// One slot per channel — a client picks its bus with `< open canN >`. On the
// T-2CAN both buses are streamed (can0 = TWAI, can1 = MCP2518FD); on the
// Feather only can0 is available. Two clients can be connected at once on the
// T-2CAN, one per channel. A new connection that arrives while every slot is
// taken is rejected (the existing clients are kept).

#define SOCKETCAND_PORT 28600

#if defined(HAS_MCP2518FD)
  #define SOCKETCAND_NUM_CHANNELS 2
#else
  #define SOCKETCAND_NUM_CHANNELS 1
#endif

enum SocketcandState {
    SC_DISCONNECTED,
    SC_WAITING_OPEN,
    SC_WAITING_RAWMODE,
    SC_RAWMODE,
};

struct SocketcandSlot {
    WiFiClient      client;
    SocketcandState state   = SC_DISCONNECTED;
    char            buf[64];
    uint8_t         len     = 0;
    int8_t          channel = -1;   // set when `< open canN >` is parsed
};

static WiFiServer     socketcand_server(SOCKETCAND_PORT);
static SocketcandSlot socketcand_slots[SOCKETCAND_NUM_CHANNELS];

#if defined(HAS_MCP2518FD)
// MCP2518FD: external CAN-FD controller wired to SPI. We run it in classic CAN
// 2.0B mode at 250 kbit/s to match the J1939 main bus. The library's RX FIFO
// is drained from loop(); frames are forwarded to socketcand as channel can1.
// Crystal frequency is board-dependent — flip to OSC_20MHz if can1 stays silent.
static ACAN2517FD g_mcp(MCP2518_CS_PIN, SPI, MCP2518_INT_PIN);
#endif

void socketcandSendFrame(const twai_message_t& msg, int8_t channel) {
    uint32_t now_ms = millis();
    uint32_t secs   = now_ms / 1000;
    uint32_t usecs  = (now_ms % 1000) * 1000;
    // EFF flag (bit 31) marks the ID as 29-bit extended — python-can expects this.
    uint32_t id_wire = msg.identifier | (msg.extd ? 0x80000000UL : 0);
    char line[80];
    int n = snprintf(line, sizeof(line), "< frame %lX %lu.%06lu ",
                     (unsigned long)id_wire,
                     (unsigned long)secs, (unsigned long)usecs);
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof(line) - 4; i++)
        n += snprintf(line + n, sizeof(line) - n, "%02X", msg.data[i]);
    n += snprintf(line + n, sizeof(line) - n, " >");
    for (auto& slot : socketcand_slots) {
        if (slot.state == SC_RAWMODE && slot.channel == channel)
            slot.client.write((const uint8_t*)line, n);
    }
}

static void socketcandHandleCommand(SocketcandSlot& slot, const char* cmd) {
    if (slot.state == SC_WAITING_OPEN && strncmp(cmd, "< open ", 7) == 0) {
        // Parse "< open canN >": after "< open " expect "canN" then space-or-'>'.
        const char* arg = cmd + 7;
        if (strncmp(arg, "can", 3) == 0 && arg[3] >= '0' && arg[3] <= '9'
                && (arg[4] == ' ' || arg[4] == '>')) {
            int ch = arg[3] - '0';
            if (ch < SOCKETCAND_NUM_CHANNELS) {
                slot.channel = (int8_t)ch;
                slot.state   = SC_WAITING_RAWMODE;
                slot.client.print("< ok >");
                return;
            }
        }
        slot.client.print("< error >");
    } else if (slot.state == SC_WAITING_RAWMODE && strcmp(cmd, "< rawmode >") == 0) {
        slot.client.print("< ok >");
        slot.state = SC_RAWMODE;
    }
    // bcmmode/isotpmode/echo/statistics are intentionally unsupported.
}

void socketcandPoll() {
    WiFiClient new_client = socketcand_server.available();
    if (new_client) {
        int free_idx = -1;
        for (int i = 0; i < SOCKETCAND_NUM_CHANNELS; i++) {
            if (socketcand_slots[i].state == SC_DISCONNECTED) { free_idx = i; break; }
        }
        if (free_idx >= 0) {
            SocketcandSlot& slot = socketcand_slots[free_idx];
            slot.client  = new_client;
            slot.client.setNoDelay(true);
            slot.client.print("< hi >");
            slot.state   = SC_WAITING_OPEN;
            slot.len     = 0;
            slot.channel = -1;
        } else {
            new_client.stop();   // pool full — keep the existing clients
        }
    }
    for (auto& slot : socketcand_slots) {
        if (slot.state != SC_DISCONNECTED && !slot.client.connected()) {
            slot.client.stop();
            slot.state   = SC_DISCONNECTED;
            slot.len     = 0;
            slot.channel = -1;
        }
        while (slot.client && slot.client.available()) {
            char c = slot.client.read();
            if (c == '<') {
                slot.len = 0;
                slot.buf[slot.len++] = c;
            } else if (slot.len > 0 && slot.len < sizeof(slot.buf) - 1) {
                slot.buf[slot.len++] = c;
                if (c == '>') {
                    slot.buf[slot.len] = '\0';
                    socketcandHandleCommand(slot, slot.buf);
                    slot.len = 0;
                }
            }
        }
    }
}

// ── BLE (Nordic UART Service) ─────────────────────────────────────────────────
// Pushes a compact (minimal) JSON snapshot to a single BLE central whenever it
// differs from what we last sent. Framing on the wire is:
//
//     [u16 big-endian length] [length bytes of JSON]
//
// sent across N notifications of up to BLE_CHUNK_BYTES each. The Android
// client reassembles by counting bytes against the length prefix. Connection
// is unpaired — anyone in range with the NUS UUID can subscribe.
//
// MTU: we request 517 server-side; the actual MTU is whatever the client
// negotiates. BLE_CHUNK_BYTES is conservative so a default-MTU client (23)
// would still receive valid (if smaller) packets — but the Android app calls
// requestMtu(517) on connect.
//
// RX characteristic is exposed for future command/control (e.g. reset session
// counters); currently writes are accepted and ignored.

#define NUS_SVC_UUID  "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_TX_UUID   "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_RX_UUID   "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"

#define BLE_CHUNK_BYTES        180
#define BLE_PUSH_INTERVAL_MS   200    // diff cadence — actual send only on change
#define BLE_INTER_CHUNK_DELAY  5

static BLEServer*         g_ble_server = nullptr;
static BLECharacteristic* g_ble_tx     = nullptr;
static volatile bool      g_ble_connected = false;
static String             g_ble_last_payload;
static uint32_t           g_ble_last_push_ms = 0;

class BleServerCb : public BLEServerCallbacks {
    void onConnect(BLEServer*) override {
        g_ble_connected   = true;
        g_ble_last_payload = "";   // force a full resend on (re)connect
    }
    void onDisconnect(BLEServer* s) override {
        g_ble_connected   = false;
        g_ble_last_payload = "";
        s->getAdvertising()->start();   // resume advertising for the next client
    }
};

